---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveTogether
source: html/ad7296e6-11dd-9d55-05a3-9deb29f30478.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveTogether Property

Can't move these elements at the same time. One of them is restricted to moving in one direction while the other is restricted to moving in a conflicting direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveTogether { get; }
```